In [2]:
import pandas as pd

In [3]:
order = pd.read_csv("orders.csv")
product = pd.read_csv("product-supplier.csv")
code = pd.read_csv("countries-iso-codes.csv", on_bad_lines='skip')

In [4]:
order.head()

,Customer ID,Customer Status,Date Order was placed,Delivery Date,Order ID,Product ID,Quantity Ordered,Total Retail Price for This Order,Cost Price Per Unit
0,579,Silver,01-Jan-17,07-Jan-17,123002578,220101400106,2,92.6,20.70
1,7574,SILVER,01-Jan-17,05-Jan-17,123004074,210201000009,1,21.7,9.95
2,28861,Gold,01-Jan-17,04-Jan-17,123000871,230100500068,1,1.7,0.80
3,43796,Gold,01-Jan-17,06-Jan-17,123002851,220100100633,1,47.9,24.05
4,54673,Gold,01-Jan-17,04-Jan-17,123003607,220200200043,1,36.9,18.30

In [6]:
order.dtypes

Customer ID                            int64
Customer Status                       object
Date Order was placed                 object
Delivery Date                         object
Order ID                               int64
Product ID                             int64
Quantity Ordered                       int64
Total Retail Price for This Order    float64
Cost Price Per Unit                  float64
dtype: object

In [7]:
order.columns.tolist()

['Customer ID',
 'Customer Status',
 'Date Order was placed',
 'Delivery Date',
 'Order ID',
 'Product ID',
 'Quantity Ordered',
 'Total Retail Price for This Order',
 'Cost Price Per Unit']

In [8]:
product.head()

,Product ID,Product Line,Product Category,Product Group,Product Name,Supplier Country,Supplier Name,Supplier ID
0,210100100001,Children,Children Outdoors,"Outdoor things, Kids",Boy's and Girl's Ski Pants with Braces,NO,Scandinavian Clothing A/S,50
1,210100100002,Children,Children Outdoors,"Outdoor things, Kids",Children's Jacket,ES,Luna sastreria S.A.,4742
2,210100100003,Children,Children Outdoors,"Outdoor things, Kids",Children's Jacket Sidney,NO,Scandinavian Clothing A/S,50
3,210100100004,Children,Children Outdoors,"Outdoor things, Kids",Children's Rain Set,NO,Scandinavian Clothing A/S,50
4,210100100005,Children,Children Outdoors,"Outdoor things, Kids",Children's Rain Suit,NO,Scandinavian Clothing A/S,50

In [9]:
product.dtypes

Product ID           int64
Product Line        object
Product Category    object
Product Group       object
Product Name        object
Supplier Country    object
Supplier Name       object
Supplier ID          int64
dtype: object

In [10]:
code.head()

      Afghanistan  AF  AFG  004
0         Albania  AL  ALB    8
1         Algeria  DZ  DZA   12
2  American Samoa  AS  ASM   16
3         Andorra  AD  AND   20
4          Angola  AO  AGO   24

In [11]:
code.dtypes # szerintem kellene adni oszlop neveket, hogy kezelni tudjuk majd
# de ha nem kell ebből nagyon felhasználni semmit, akkor be sem kell olvasni

Afghanistan    object
AF             object
AFG            object
004             int64
dtype: object

1. Kérdés: Hány féle termék szerepel az adatbázisban, ha a kategóriákat vesszük alapul?
    13 féle termék szerepel a termékkategóriák alapján.

In [12]:
product["Product Category"].value_counts()

Product Category
Clothes                     1525
Assorted Sports Articles     911
Children Sports              722
Shoes                        496
Outdoors                     357
Golf                         346
Indoor Sports                264
Running - Jogging            214
Swim Sports                  205
Racket Sports                169
Winter Sports                164
Team Sports                   81
Children Outdoors             50
Name: count, dtype: int64

2_a. Kérdés: Melyik szállító árulja az adatbázisban a legtöbb, illetve legkevesebb terméket?
    Legtöbb terméket árulja: Eclipse Inc (1115 db.)
    Legkevesebb terméket árulja: A. Pereira Sport (1 db.)

In [13]:
product["Supplier Name"].value_counts()

Supplier Name
Eclipse Inc                      1115
3Top Sports                       707
Luna sastreria S.A.               369
Van Dammeren International        221
Magnifico Sports                  186
                                 ...
Meister Pharma & Chemie GmBH        7
Rubby Zapatos S.A.                  5
SnowSports International GmBH       5
Dutchman Bikes                      4
A. Pereira Sport                    1
Name: count, Length: 64, dtype: int64

2_b. Kérdés: A termék-kategóriát figyelembe véve mely szállítók kínálják a legtöbbféle terméket, és melyek a legkevesebb fajtát (az adott kategóriában)?

In [92]:
grouped_counts = product.groupby(['Product Category', 'Supplier Name'])['Product Name'].count().reset_index()
grouped_counts

             Product Category                  Supplier Name  Product Name
0    Assorted Sports Articles                  A Team Sports            12
1    Assorted Sports Articles    AllSeasons Outdoor Clothing             4
2    Assorted Sports Articles            Bianco Trading S.A.             8
3    Assorted Sports Articles                  Bon Garrments             6
4    Assorted Sports Articles             British Sports Ltd            14
..                        ...                            ...           ...
175             Winter Sports                     Norsok A/S            10
176             Winter Sports      Scandinavian Clothing A/S            14
177             Winter Sports  SnowSports International GmBH             5
178             Winter Sports           Truls Sporting Goods             6
179             Winter Sports                      Twain Inc            23

[180 rows x 3 columns]

In [93]:
max_suppliers = grouped_counts.loc[grouped_counts.groupby('Product Category')['Product Name'].idxmax()]
min_suppliers = grouped_counts.loc[grouped_counts.groupby('Product Category')['Product Name'].idxmin()]

In [95]:
print("Supplier with the most product names in each category:")
print(max_suppliers)

Supplier with the most product names in each category:
             Product Category               Supplier Name  Product Name
15   Assorted Sports Articles            Magnifico Sports           179
39          Children Outdoors   Scandinavian Clothing A/S            20
47            Children Sports                 Eclipse Inc           222
65                    Clothes                 Eclipse Inc           642
94                       Golf  Van Dammeren International           159
100             Indoor Sports              Top Sports Inc           116
117                  Outdoors                  Top Sports            64
120             Racket Sports          British Sports Ltd            58
133         Running - Jogging                Force Sports           140
141                     Shoes                 Eclipse Inc           247
156               Swim Sports     Nautlius SportsWear Inc           107
166               Team Sports              Teamsports Inc            20
169             Winter Sports     CrystalClear Optics Inc            34

In [96]:
print("\nSupplier with the least product names in each category:")
print(min_suppliers)

Supplier with the least product names in each category:
             Product Category                Supplier Name  Product Name
7    Assorted Sports Articles                  Eclipse Inc             1
37          Children Outdoors           Miller Trading Inc             1
52            Children Sports           Pro Sportswear Inc             1
58                    Clothes             A. Pereira Sport             1
85                       Golf  AllSeasons Outdoor Clothing             2
95              Indoor Sports                A Team Sports             1
102                  Outdoors                  3Top Sports             2
122             Racket Sports      CrystalClear Optics Inc             1
134         Running - Jogging         Greenline Sports Ltd             2
140                     Shoes           British Sports Ltd             1
152               Swim Sports                  3Top Sports             2
164               Team Sports           Pro Sportswear Inc             1
170             Winter Sports                  Eclipse Inc             1